# Start learn python code to 100 tasks https://code.mu/ru/python/tasker/stager/
# Задача 1.1 -№2  Дана строка. Выведите в консоль длину этой строки.

n = input("введите текст") # ввод текста из консоли
print(len(n)) # печатает длинну текста в консоль включая пробелы