# Start learn python code to 100 tasks https://code.mu/ru/python/tasker/stager/
# Задача 1.2 №6 Дан список:
#
# [1, 2, 3, 4, 5, 6]
# Получите из него следующий срез:
#
# [1, 2, 3]


lst = [1, 2, 3, 4, 5, 6]
result = lst[:3]  #  Срез lst[:3] означает: взять элементы с начала списка до индекса 3 (не включая его).
print(result)   # [1, 2, 3]


