# Start learn python code to 100 tasks https://code.mu/ru/python/tasker/stager/
# Задача 1.1 №4  Дано число. Проверьте, четное оно или нет.

x = int(input('ведите число 1'))

z: int = x/2
if z == int(z):
    print('четное')
else:
    print('нечетное')
