# Start learn python code to 100 tasks https://code.mu/ru/python/tasker/stager/
# Задача 1.2 №4 Дано число. Выведите количество цифр в этом числе.
""" задача не завершена. делаю на основепредыщего материала"""


number3 = str(input('введите число:'))
'''добавить проверку строки на цыфры и буквы'''

if  number3.isalnum():
    print(len(number3))
else:
    print('none')


"""if z:
    digit3 = int(number3[])
        print(len(digit3)"""


