# Start learn python code to 100 tasks https://code.mu/ru/python/tasker/stager/
# Задача 1.1 -№3  Дана строка. Выведите в консоль последний символ строки.

n = str(input()) # создал строку ввода консоли
last_n = n[-1]   # n[-1] - возварщает последний символ строки
print(last_n)