# Start learn python code to 100 tasks https://code.mu/ru/python/tasker/stager/
# Задача 1.1 -№3  Дана строка. Выведите в консоль последний символ строки.

n = str(input())
print(str([str.length - 1]))