# Start learn python code to 100 tasks https://code.mu/ru/python/tasker/stager/
#Дан список:

#[1, 2, 3, 4, 5, 6]
#Получите из него следующий срез:

#[3, 4, 5]

n = [1, 2, 3, 4, 5, 6]

result = n[2:5]
print(result)

