# Start learn python code to 100 tasks https://code.mu/ru/python/tasker/stager/
#Дана некоторая строка:

#'abcde'
#Получите список ее символов:

#['a', 'b', 'c', 'd', 'e']

n = list(input("ведите текст"))



print(n)




